<h1>Содержание<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Цель-исследования---проанализировать-базу-данных-и-ответить-на-5-вопросов:" data-toc-modified-id="Цель-исследования---проанализировать-базу-данных-и-ответить-на-5-вопросов:-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Цель исследования - проанализировать базу данных и ответить на 5 вопросов:</a></span><ul class="toc-item"><li><span><a href="#Знакомимся-с-базой" data-toc-modified-id="Знакомимся-с-базой-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Знакомимся с базой</a></span></li><li><span><a href="#№1---посчитаем,-сколько-книг-вышло-после-1-января-2000-года" data-toc-modified-id="№1---посчитаем,-сколько-книг-вышло-после-1-января-2000-года-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>№1 - посчитаем, сколько книг вышло после 1 января 2000 года</a></span><ul class="toc-item"><li><span><a href="#Вывод:-после-1-января-2000-года-вышло-819-книг." data-toc-modified-id="Вывод:-после-1-января-2000-года-вышло-819-книг.-1.2.1"><span class="toc-item-num">1.2.1&nbsp;&nbsp;</span>Вывод: после 1 января 2000 года вышло 819 книг.</a></span></li></ul></li><li><span><a href="#№2---для-каждой-книги-посчитаем-количество-обзоров-и-среднюю-оценку" data-toc-modified-id="№2---для-каждой-книги-посчитаем-количество-обзоров-и-среднюю-оценку-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>№2 - для каждой книги посчитаем количество обзоров и среднюю оценку</a></span><ul class="toc-item"><li><span><a href="#Вывод:-наибольший-средний-рейтинг-имеющихся-книг-составляет-5,-а-самая-непопулярная-книга-имеет-рейтинг-1,5" data-toc-modified-id="Вывод:-наибольший-средний-рейтинг-имеющихся-книг-составляет-5,-а-самая-непопулярная-книга-имеет-рейтинг-1,5-1.3.1"><span class="toc-item-num">1.3.1&nbsp;&nbsp;</span>Вывод: наибольший средний рейтинг имеющихся книг составляет 5, а самая непопулярная книга имеет рейтинг 1,5</a></span></li></ul></li><li><span><a href="#№3---определим-издательство,-которое-выпустило-наибольшее-число-книг-толще-50-страниц-—-так-мы-исключим-из-анализа-брошюры" data-toc-modified-id="№3---определим-издательство,-которое-выпустило-наибольшее-число-книг-толще-50-страниц-—-так-мы-исключим-из-анализа-брошюры-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>№3 - определим издательство, которое выпустило наибольшее число книг толще 50 страниц — так мы исключим из анализа брошюры</a></span><ul class="toc-item"><li><span><a href="#Вывод:-издательство-Penguin-Books-выпустило-больше-всего-книг-толще-50-страниц." data-toc-modified-id="Вывод:-издательство-Penguin-Books-выпустило-больше-всего-книг-толще-50-страниц.-1.4.1"><span class="toc-item-num">1.4.1&nbsp;&nbsp;</span>Вывод: издательство Penguin Books выпустило больше всего книг толще 50 страниц.</a></span></li></ul></li><li><span><a href="#№4---определим-автора-с-самой-высокой-средней-оценкой-книг-—-учитываем-только-книги-с-50-и-более-оценками" data-toc-modified-id="№4---определим-автора-с-самой-высокой-средней-оценкой-книг-—-учитываем-только-книги-с-50-и-более-оценками-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span>№4 - определим автора с самой высокой средней оценкой книг — учитываем только книги с 50 и более оценками</a></span><ul class="toc-item"><li><span><a href="#Вывод:-Книги-J.K.-Rowling/Mary-GrandPré-пользуются-наибольшей-популярностью.-Средний-рейтинг-составляет-4,28" data-toc-modified-id="Вывод:-Книги-J.K.-Rowling/Mary-GrandPré-пользуются-наибольшей-популярностью.-Средний-рейтинг-составляет-4,28-1.5.1"><span class="toc-item-num">1.5.1&nbsp;&nbsp;</span>Вывод: Книги J.K. Rowling/Mary GrandPré пользуются наибольшей популярностью. Средний рейтинг составляет 4,28</a></span></li></ul></li><li><span><a href="#№5---посчитаем-среднее-количество-обзоров-от-пользователей,-которые-поставили-больше-50-оценок" data-toc-modified-id="№5---посчитаем-среднее-количество-обзоров-от-пользователей,-которые-поставили-больше-50-оценок-1.6"><span class="toc-item-num">1.6&nbsp;&nbsp;</span>№5 - посчитаем среднее количество обзоров от пользователей, которые поставили больше 50 оценок</a></span><ul class="toc-item"><li><span><a href="#Вывод:-наиболее-активные-пользователи,-которые-поставили-более-50-оценок,-в-среднем-составляют-24-обзоров" data-toc-modified-id="Вывод:-наиболее-активные-пользователи,-которые-поставили-более-50-оценок,-в-среднем-составляют-24-обзоров-1.6.1"><span class="toc-item-num">1.6.1&nbsp;&nbsp;</span>Вывод: наиболее активные пользователи, которые поставили более 50 оценок, в среднем составляют 24 обзоров</a></span></li></ul></li></ul></li><li><span><a href="#Общий-вывод:" data-toc-modified-id="Общий-вывод:-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Общий вывод:</a></span></li></ul></div>

# Проект по SQL

**Коронавирус застал мир врасплох, изменив привычный порядок вещей. В свободное время жители городов больше не выходят на улицу, не посещают кафе и торговые центры. Зато стало больше времени для книг. Это заметили стартаперы — и бросились создавать приложения для тех, кто любит читать. Наша компания решила быть на волне и купила крупный сервис для чтения книг по подписке. Наша первая задача как аналитика — проанализировать базу данных.**

# Описание данных
 - Таблица books
 - Содержит данные о книгах:
 -- book_id — идентификатор книги;
 -- author_id — идентификатор автора;
 -- title — название книги;
 -- num_pages — количество страниц;
 -- publication_date — дата публикации книги;
 -- publisher_id — идентификатор издателя.
 - Таблица authors
 - Содержит данные об авторах:
 -- author_id — идентификатор автора;
 -- author — имя автора.
 - Таблица publishers
 - Содержит данные об издательствах:
 -- publisher_id — идентификатор издательства;
 -- publisher — название издательства;
 - Таблица ratings
 - Содержит данные о пользовательских оценках книг:
 -- rating_id — идентификатор оценки;
 -- book_id — идентификатор книги;
 -- username — имя пользователя, оставившего оценку;
 -- rating — оценка книги.
 - Таблица reviews
 - Содержит данные о пользовательских обзорах:
 -- review_id — идентификатор обзора;
 -- book_id — идентификатор книги;
 -- username — имя автора обзора;
 -- text — текст обзора.

## Цель исследования - проанализировать базу данных и ответить на 5 вопросов:
1. Сколько в базе книг, которые вышли после 1 января 2000 года;
2. Посчитать для каждой книги количество обзоров и среднюю оценку;
3. Определить издательство - лидера по выпуску книг тольщиной более 50 страниц (для исключения брошюр);
4. Определить автора с самой высокой средней оценкой популярных книг (книги с 50 и более оценками);
5. Посчитать среднее количество обзоров наиболее активных пользователей (пользователи, которые поставили более 50 оценок).

In [1]:
# импортируем библиотеки
import pandas as pd
from sqlalchemy import create_engine

### Знакомимся с базой

In [2]:
query = '''
SELECT *
FROM books
LIMIT 5
'''

In [3]:
pd.io.sql.read_sql(query, con = engine)

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

In [4]:
query = '''
SELECT *
FROM authors
LIMIT 5
'''

In [5]:
pd.io.sql.read_sql(query, con = engine)

   author_id                          author
0          1                      A.S. Byatt
1          2  Aesop/Laura Harris/Laura Gibbs
2          3                 Agatha Christie
3          4                   Alan Brennert
4          5        Alan Moore/David   Lloyd

In [6]:
query = '''
SELECT *
FROM publishers
LIMIT 5
'''

In [7]:
pd.io.sql.read_sql(query, con = engine)

   publisher_id                          publisher
0             1                                Ace
1             2                           Ace Book
2             3                          Ace Books
3             4                      Ace Hardcover
4             5  Addison Wesley Publishing Company

In [8]:
query = '''
SELECT *
FROM ratings
LIMIT 5
'''

In [9]:
pd.io.sql.read_sql(query, con = engine)

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2

In [10]:
query = '''
SELECT *
FROM reviews
LIMIT 5
'''

In [11]:
pd.io.sql.read_sql(query, con = engine)

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...

### №1 - посчитаем, сколько книг вышло после 1 января 2000 года

In [12]:
query = '''
SELECT COUNT(DISTINCT book_id)
FROM books
WHERE publication_date > '2000-01-01'
'''

In [13]:
pd.io.sql.read_sql(query, con = engine)

   count
0    819

#### Вывод: после 1 января 2000 года вышло 819 книг.

### №2 - для каждой книги посчитаем количество обзоров и среднюю оценку

In [14]:
query = '''
SELECT DISTINCT b.book_id,
       b.title,
       COUNT(DISTINCT re.review_id) AS count_review,
       AVG(r.rating) AS avg_rating
FROM books AS b
LEFT JOIN ratings AS r ON b.book_id = r.book_id
LEFT JOIN reviews AS re ON b.book_id = re.book_id
GROUP BY b.book_id, b.title
ORDER BY avg_rating DESC, b.title
'''

In [15]:
pd.io.sql.read_sql(query, con = engine)

,book_id,title,count_review,avg_rating
0,17,A Dirty Job (Grim Reaper #1),4,5.00
1,20,A Fistful of Charms (The Hollows #4),2,5.00
2,55,A Woman of Substance (Emma Harte Saga #1),2,5.00
3,57,Act of Treason (Mitch Rapp #9),2,5.00
4,62,Alas Babylon,2,5.00
...,...,...,...,...
995,915,The World Is Flat: A Brief History of the Twen...,3,2.25
996,202,Drowning Ruth,3,2.00
997,316,His Excellency: George Washington,2,2.00
998,371,Junky,2,2.00
999,303,Harvesting the Heart,2,1.50

#### Вывод: наибольший средний рейтинг имеющихся книг составляет 5, а самая непопулярная книга имеет рейтинг 1,5

### №3 - определим издательство, которое выпустило наибольшее число книг толще 50 страниц — так мы исключим из анализа брошюры

In [16]:
query = '''
SELECT p.publisher,
       COUNT(DISTINCT b.book_id) AS books_cnt
FROM publishers AS p
LEFT JOIN books AS b ON p.publisher_id = b.publisher_id
WHERE b.num_pages > 50
GROUP BY p.publisher
ORDER BY books_cnt DESC
LIMIT 5
'''

In [17]:
pd.io.sql.read_sql(query, con = engine)

                  publisher  books_cnt
0             Penguin Books         42
1                   Vintage         31
2  Grand Central Publishing         25
3          Penguin Classics         24
4          Ballantine Books         19

#### Вывод: издательство Penguin Books выпустило больше всего книг толще 50 страниц.

### №4 - определим автора с самой высокой средней оценкой книг — учитываем только книги с 50 и более оценками

In [18]:
query = '''
SELECT cnt.author AS author, AVG(cnt.avg_rating) AS avg_rating
FROM
(SELECT a.author AS author, b.book_id, AVG(r.rating) AS avg_rating, COUNT(r.rating) AS rating_cnt
FROM books as b
INNER JOIN authors AS a ON b.author_id = a.author_id
INNER JOIN ratings AS r ON r.book_id = b.book_id
GROUP BY author, b.book_id
HAVING COUNT(r.rating) >= 50) AS cnt
GROUP BY author
ORDER BY avg_rating DESC
LIMIT 1
'''

In [19]:
pd.io.sql.read_sql(query, con = engine)

                       author  avg_rating
0  J.K. Rowling/Mary GrandPré    4.283844

#### Вывод: Книги J.K. Rowling/Mary GrandPré пользуются наибольшей популярностью. Средний рейтинг составляет 4,28

### №5 - посчитаем среднее количество обзоров от пользователей, которые поставили больше 50 оценок

In [20]:
query = '''
SELECT ROUND(AVG(re.review_cnt)) AS avg_review
FROM (SELECT COUNT(review_id) AS review_cnt
FROM reviews
WHERE username IN (SELECT username
                   FROM ratings
                   GROUP BY username
                   HAVING COUNT(ratings) > 50)
                   GROUP BY username) AS re
'''

In [21]:
pd.io.sql.read_sql(query, con = engine)

   avg_review
0        24.0

#### Вывод: наиболее активные пользователи, которые поставили более 50 оценок, в среднем составляют 24 обзоров

## Общий вывод:
- Целью нашего исследования были:
1. Посчитать сколько в базе книг, которые вышли после 1 января 2000 года;
2. Посчитать для каждой книги количество обзоров и среднюю оценку;
3. Определить издательство - лидера по выпуску книг тольщиной более 50 страниц (для исключения брошюр);
4. Определить автора с самой высокой средней оценкой популярных книг (книги с 50 и более оценками);
5. Посчитать среднее количество обзоров наиболее активных пользователей (пользователи, которые поставили более 50 оценок).
- Проведя исследование можем ответить на все эти вопросы следующее:
1. После 1 января 2000 года вышло 819 книг;
2. Наибольший средний рейтинг имеющихся книг составляет 5, а самая непопулярная книга имеет рейтинг 1,5;
3. Издательство Penguin Books выпустило больше всего книг толще 50 страниц;
4. Книги J.K. Rowling/Mary GrandPré пользуются наибольшей популярностью. Средний рейтинг составляет 4,28;
5. Наиболее активные пользователи, которые поставили более 50 оценок, в среднем составляют 24 обзоров.